app/controllers/users_controller.rb

INSERT INTO "users" ("email", "encrypted_password", "referrer_id", "created_at", "updated_at", "remember_token") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "huUjTRuDB_qkzufQ-0DVPQ"], ["updated_at", "2016-11-13 02:16:17.223658"], ["id", 1]]
---
  def create
    @user = user_from_params
    set_referrer

    if @user.save